export const quests = [
  {
    key: 'amok',
    status: 'active',
    title: 'АМОК',
    type: 'Квест',
    intro: `С 90-х годов доктор Марин исследовал опасное психическое заболевание. Одной девушке удалось выжить, и она утверждает, что эксперимент АМОК вышел из под контроля…`,
    ageLimit: '16+',
    ageComment: '16+ (с 14 лет в сопровождении взрослых)',
    carouselData: [
      { name: 'amok1.png', type: 'image' },
      { name: 'amok2.png', type: 'image' },
      { name: 'amok3.png', type: 'image' },
      { name: 'amok4.png', type: 'image' },
    ],
    previewData: [
      {
        key: 'playersCount',
        title: 'Игроков',
        value: '2 – 6',
      },
      {
        key: 'time',
        title: 'Время',
        value: '60 мин',
      },
      {
        key: 'price',
        title: 'Цена',
        value: 'от 5000 ₽',
      },
      {
        key: 'ageLimit',
        title: 'Возраст',
        value: '16+',
      },
    ],
    data: [
      {
        key: 'description',
        title: 'Описание',
        value: `С 90-х годов доктор психиатрических наук Марин Дмитрий Сергеевич долгое время проводил эксперименты над больными страшным психическим заболеванием под названием АМОК, характеризующимся резким двигательным возбуждением и агрессивными действиями, беспричинными нападениями на людей. Изуродованные и убитые тела людей находили в разных точках Калининградской области. Однако одной девушке удалось выжить, и она утверждает, что эксперимент вышел из под контроля…`,
      },
      {
        key: 'features',
        title: 'Особенности',
        value: 'Квест с элементами перформанса.',
      },
      {
        key: 'price',
        title: 'Цены',
        value:
          'Стоимость игры для команды от 2 до 4 человек – 5000 рублей. Доплата за дополнительного игрока – 1000 рублей.',
      },
      {
        key: 'restrictions',
        title: 'Ограничения',
        value: `Квест нельзя проходить людям с астмой и эпилепсией. Если у вас имеются противопоказания к активным спортивным играм, а также травмы, обязательно уведомите об этом оператора.  Запрещено посещение перформанса в состоянии алкогольного или другого опьянения. В случае неадекватного и агрессивного поведения персонал вправе отказать команде в прохождении проекта.`,
      },
    ],
  },
  {
    key: 'fortuneteller',
    status: 'active',
    title: 'Гадалка',
    type: 'Квест',
    intro: `Готовы ли вы погрузиться в мир тени и тайн? Откройте двери в загробный мир, но берегитесь: души не всегда добры к незваным гостям…`,
    ageLimit: '16+',
    ageComment: '16+ (с 14 лет в сопровождении взрослых)',
    carouselData: [
      { name: 'fortuneteller1.jpg', type: 'image' },
      { name: 'fortuneteller2.jpg', type: 'image' },
      { name: 'fortuneteller3.jpg', type: 'image' },
      { name: 'fortuneteller4.jpg', type: 'image' },
      { name: 'fortuneteller5.jpg', type: 'image' },
      { name: 'fortuneteller6.jpg', type: 'image' },
      { name: 'fortuneteller7.jpg', type: 'image' },
      { name: 'fortuneteller8.jpg', type: 'image' },
      { name: 'fortuneteller9.jpg', type: 'image' },
    ],
    previewData: [
      {
        key: 'playersCount',
        title: 'Игроков',
        value: '2 – 6',
      },
      {
        key: 'time',
        title: 'Время',
        value: '60 мин',
      },
      {
        key: 'price',
        title: 'Цена',
        value: 'от 5000 ₽',
      },
      {
        key: 'ageLimit',
        title: 'Возраст',
        value: '16+',
      },
    ],
    data: [
      {
        key: 'description',
        title: 'Описание',
        value: `Вы и ваша группа друзей решаете проверить свои нервы и отправляетесь на старую заброшенную усадьбу, где живет многоликая сибирская ведьма София. Легенды гласят, что она обладала способностями видеть будущее и проводить ритуалы, позволяющие общаться с душами ушедших. Во время последних гаданий вокруг усадьбы начали происходить странные и пугающие события: люди пропадали, слышались шепоты, а ночами появлялись призраки.

Но будьте осторожны! Каждая ваша находка будет под контролем потусторонних сил. Гадальные карты могут предсказать не только ваше будущее, но и открыть порталы в мир умерших. Вам предстоит столкнуться с душами, которые не нашли покоя, и узнать, что они готовы сделать, чтобы вернуть утраченное.

Пройдите через зловещие коридоры, разгадайте головоломки, основанные на древних ритуалах, и избегайте ловушек, установленных злой гадалкой. Выясните, чем закончился ее последний ритуал, и что за ним скрывается. Успеете ли вы выбраться до того, как темные силы заберут вас в свой плен?`,
      },
      {
        key: 'features',
        title: 'Особенности',
        value: `• Криповая атмосфера и напряженный сюжет
        • Элементы взаимодействия с окружающей средой
        • Мистические головоломки и загадки
        • Страшные звуковые эффекты и неожиданности, способные вызвать настоящие мурашки по коже
        • Предметы которые двигаются сами по себе`,
      },
      {
        key: 'price',
        title: 'Цены',
        value:
          'Стоимость игры для команды от 2 до 4 человек – 5000 рублей. Доплата за дополнительного игрока – 1000 рублей',
      },
    ],
  },
  {
    key: 'observation',
    status: 'active',
    title: 'Комната просмотров',
    type: '',
    intro:
      'Для просмотра за прохождением квеста вашими друзьями, наша просторная комната, оборудованная телевизором и камином.',
    ageLimit: '0+',
    ageComment: '16+ (с 14 лет в сопровождении взрослых)',
    carouselData: [
      { name: 'observation1.jpg', type: 'image' },
      { name: 'observation2.jpg', type: 'image' },
      { name: 'observation3.jpg', type: 'image' },
      { name: 'observation4.jpg', type: 'image' },
      { name: 'observation5.jpg', type: 'image' },
    ],
    previewData: [
      {
        key: 'guestsCount',
        title: 'Вмещаемость',
        value: '12 человек',
      },
      {
        key: 'ageLimit',
        title: 'Возраст',
        value: '0+',
      },
    ],
    data: [
      {
        key: 'description',
        title: 'Описание',
        value: `Для просмотра за прохождением квеста вашими друзьями, наша просторная комната, оборудованная телевизором и камином. Также зал способен подарить приятную атмосферу для любого мероприятия. Наше пространство отлично подойдет для проведения частных мероприятий, семейных праздников и дней рождений, а также для творческих мероприятий, кинопросмотров, тренингов и мастер-классов.`,
      },
      {
        key: 'features',
        title: 'Особенности',
        value: `• Вместимость до 12 человек
        • Доп. услуга кейтеринга
        • Доп. услуга аниматора для маленьких детей
        • Доп. услуга украшения зала
        • Уникальное место для организации мероприятия
        • Телевизор 
        • Камин`,
      },
      {
        key: 'restrictions',
        title: 'Ограничения',
        value:
          'Запрещено посещение смотровой в состоянии алкогольного или другого опьянения. В случае неадекватного и агрессивного поведения персонал вправе отказать в дальнейшем времяпровождении.',
      },
    ],
  },
]

export const contacts = {
  phone: process.env.REACT_APP_PHONE_NUMBER,
  phoneLink: `tel:+${process.env.REACT_APP_PHONE_NUMBER}`,
  telegram: process.env.REACT_APP_TELEGRAM,
  whatsapp: process.env.REACT_APP_WHATSAPP,
  vk: process.env.REACT_APP_VK_LINK,
  email: process.env.REACT_APP_EMAIL,
  emailLink: `mailto:${process.env.REACT_APP_EMAIL}`,
  adderss: process.env.REACT_APP_ADDRESS,
  yandexMapLink: process.env.REACT_APP_YANDEX_MAP_LINK,
}
