export const quests = [
  {
    key: 'collector',
    title: 'Коллекционер',
    description: `На улице Клинической в заброшенном здании обнаружили логово маньяка
    с телами жертв. Последнюю пропавшую девушку найти не удалось.
    Возможно, она еще жива... Мы надеемся, что вам удастся ее отыскать и
    не стать очередной жертвой маньяка.`,
    backgroundImage: 'bg-collector',
  },
  {
    key: 'meggi',
    title: 'Проклятие Мэгги',
    description: `Окунись в атмосферу страха и стань главным персонажем жуткой истории
    о проклятой Мэгги. Какие тайны она скрывает? Пройди все испытания,
    проявив свои лучшие качества!`,
    backgroundImage: 'bg-meggi',
  },
]
